In [2]:
import pandas as pd
import numpy as np

In [3]:
df = pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/refs/heads/master/titanic.csv")

In [3]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

# Intenciones 

En este EDA mi intencio es explorar las caracteristicas de las personas que sobreviven y la de las que no sobreviven 

**Preguntas Interesantes**

1. Ser Mujer mejoraba tus posibilidades de Supervivencia?
2. Que rango etario es el que mas sobrevivia
3. Tener un Status elevado en la sociedad mejoraba tus posibilidades de supervivencia?
4. Gastar mas dinero en Tickets mejoraba tus chances de sobrevivir?
5. Pertenecer a primera clase aumenta tus posibilidades de sobrevivir?
6. Tener hijos hace que tus posibilidades de supervivencia mejoren?
7. Existia camaraderia entre personas que embarkaban en el mismo puerto que mejorara sus chances de sobrevivir?

# Indice 
1. [Missing Values](#handeling-missing-values)
2. [Duplicated Values](#handeling-duplicates)
3. [Analisis de Tipo de Datos](#analisis-de-tipo-de-datos)

# Handeling Missing Values

In [25]:
(df.isna().sum()/len(df))*100

PassengerId     0.000000
Survived        0.000000
Pclass          0.000000
Name            0.000000
Sex             0.000000
Age            19.865320
SibSp           0.000000
Parch           0.000000
Ticket          0.000000
Fare            0.000000
Cabin          77.104377
Embarked        0.224467
dtype: float64

In [26]:
df.drop(columns="Cabin",inplace=True)

In [37]:
df["Embarked"].ffill(inplace=True)

In [28]:
df["Age"].fillna(df["Age"].mean(),inplace=True)

In [38]:
(df.isna().sum()/len(df))*100

PassengerId    0.0
Survived       0.0
Pclass         0.0
Name           0.0
Sex            0.0
Age            0.0
SibSp          0.0
Parch          0.0
Ticket         0.0
Fare           0.0
Embarked       0.0
dtype: float64

# Handeling Duplicates

In [20]:
test = df.duplicated()
df[test]

Empty DataFrame
Columns: [PassengerId, Survived, Pclass, Name, Sex, Age, SibSp, Parch, Ticket, Fare, Cabin, Embarked]
Index: []

# Analisis de Tipo de Datos

In [40]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          891 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Embarked     891 non-null    object
dtypes: float64(2), int64(5), object(4)
memory usage: 76.7+ KB

In [4]:
df_numeric = df.select_dtypes(["int64","float64"])
df_categoric = df.select_dtypes("object")

In [42]:
df_numeric.head()

   PassengerId  Survived  Pclass   Age  SibSp  Parch     Fare
0            1         0       3  22.0      1      0   7.2500
1            2         1       1  38.0      1      0  71.2833
2            3         1       3  26.0      0      0   7.9250
3            4         1       1  35.0      1      0  53.1000
4            5         0       3  35.0      0      0   8.0500

In [43]:
df_categoric.head()

,Name,Sex,Ticket,Embarked
0,"Braund, Mr. Owen Harris",male,A/5 21171,S
1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,PC 17599,C
2,"Heikkinen, Miss. Laina",female,STON/O2. 3101282,S
3,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,113803,S
4,"Allen, Mr. William Henry",male,373450,S

In [49]:
df_numeric["PassengerId"].nunique()

891

In [6]:
import re

In [26]:
# Regular expression pattern to match common name titles
pattern = r"(Mr\.|Master\.|Mrs\.|Miss\.)\s+"

df[~df_categoric["Name"].str.contains(pattern, regex=True)][["Name","Survived"]]

C:\Users\Usuario\AppData\Local\Temp\ipykernel_8828\3111748349.py:4: UserWarning: This pattern is interpreted as a regular expression, and has match groups. To actually get the groups, use str.extract.
  df[~df_categoric["Name"].str.contains(pattern, regex=True)][["Name","Survived"]]

                                                  Name  Survived
30                            Uruchurtu, Don. Manuel E         0
149                  Byles, Rev. Thomas Roussel Davids         0
150                         Bateman, Rev. Robert James         0
245                        Minahan, Dr. William Edward         0
249                      Carter, Rev. Ernest Courtenay         0
317                               Moraweck, Dr. Ernest         0
369                      Aubart, Mme. Leontine Pauline         1
398                                   Pain, Dr. Alfred         0
443                          Reynaldo, Ms. Encarnacion         1
449                     Peuchen, Major. Arthur Godfrey         1
536                  Butt, Major. Archibald Willingham         0
556  Duff Gordon, Lady. (Lucille Christiana Sutherl...         1
599       Duff Gordon, Sir. Cosmo Edmund ("Mr Morgan")         1
626                     Kirkland, Rev. Charles Leonard         0
632                          Stahelin-Maeglin, Dr. Max         1
641                               Sagesser, Mlle. Emma         1
647                Simonius-Blumer, Col. Oberst Alfons         1
660                      Frauenthal, Dr. Henry William         1
694                                    Weir, Col. John         0
710   Mayne, Mlle. Berthe Antonine ("Mrs de Villiers")         1
745                       Crosby, Capt. Edward Gifford         0
759  Rothes, the Countess. of (Lucy Noel Martha Dye...         1
766                          Brewe, Dr. Arthur Jackson         0
796                        Leader, Dr. Alice (Farnham)         1
822                    Reuchlin, Jonkheer. John George         0
848                                  Harper, Rev. John         0
886                              Montvila, Rev. Juozas         0